[ 
{   
    "id": 28,
    "type": "small ensemble",
    "instrumentation": "flute, bass clarinet, violin, viola, cello",
    "title": "ebb, flow",
    "year": "2025",
    "duration": "7'30",
    "premierDate": "31 March, 2025",
    "premierLocation": "Salle Cortot, Paris",
    "premierEnsemble": "Ensemble Variances",
    "commission": true,
    "commissioner": "École Normale de Musique de Paris",
    "programNote": "”ebb, flow” is a short work in two movements concerning the nature of water. I recently had the opportunity to spend some time on the island of Mallorca, and while there I made the most of the beautiful natural landscape by going hiking in the mountains on the coast. Perched atop cliffs overlooking the Mediterranean, I was struck by the immense beauty of the waves below as they crashed into the rocky shore. What most captivated me was the irregular regularity of their movements, the way in which movements would occur and reoccur with slight differences, again and again. My piece is an attempt to capture this spirit, and is constructed out of repetitive materials that push and pull, gradually evolving over the course of the music.",
    "scoreImageLoc": "photos/covers/EbbFlowCover.png",
    "soundCloudLink": null,
    "youtubeLink": null,
    "thumbnail": "photos/thumbnails/ebbsAndFlows.jpg"
}, 
{
    "id": 27,
    "type": "solo / duo",
    "instrumentation": "piano",
    "title": "Malicious Compliance",
    "year": "2025",
    "duration": "5'30",
    "premierDate": "25 March, 2025",
    "premierLocation": "Salle Cortot, Paris",
    "premierEnsemble": "Ariela Bohrod",
    "commission": true,
    "commissioner": "École Normale de Musique de Paris",
    "programNote": "It's a strange time to be an American living abroad. Each day I read the news from home with a mixture of fear, anger, and sadness, filled with the distinct impression that I'm watching helplessly from afar as a disaster unfolds. Even at such a distance, I feel an exhausting emotional closeness to unfolding events, tethered to them by virtue of my nationality and upbringing. A term being thrown about a lot lately by the new administration's spokespeople is ”malicious compliance.” By this they seem to mean government employees doing exactly what they're ordered to do and the result being exactly as terrible as everyone but the administration predicted. There's really no need for malice on the part of the bureaucracy when there's already so much of it amongst their bosses. Far from ”malicious compliance,” this is just what compliance with malicious people looks like. But let's imagine the administration is right about this: In my piece I ask what this phenomenon might look like in music. The pianist first suggests musical ideas in a gentle way, with a quiet, tremulous texture. These ideas are then repeated back in a warped, malicious manner that comes to dominate more and more as the piece progresses. By the culmination of the process, the ideas presented at the outset have mutated completely into grotesque, rage-filled parodies of themselves, a savage and ugly cacophony that drowns out any dissent. A brief coda sees the return of the gentle music, as a kind of an almost hopeful turn, but this hope vanishes almost as quickly as it appears. Only time will tell whether or not the analogy proves to be apt.",
    "scoreImageLoc": "photos/covers/MaliciousCompliance.png",
    "soundCloudLink": "soundcloud%3Atracks%3A2111731647%3Fsecret_token%3Ds-USusnhF2AUq",
    "youtubeLink": "hJ4DXGx6SzA",
    "thumbnail": "photos/covers/MaliciousCompliance.png"
},

{
    "id": 26,
    "type": "solo / duo",
    "instrumentation": "prepared piano four hands and live electronics",
    "title": "how to be both",
    "year": "2025",
    "duration": "12'00",
    "premierDate": "27 June, 2025",
    "premierLocation": "Grand Salon, Fondation des États-Unis, Paris",
    "premierEnsemble": "Ariela Bohrod & Gabriel Newsham",
    "commission": true,
    "commissioner": "The Fulbright Program & La Fondation des États-Unis",
    "programNote": "When I moved to Paris last fall, one of the first things I noticed was the noise. I've never lived in a city of its scale or size before, and I was shocked at the way the city seems to hum and buzz at an elevated volume. At the same time, scattered pockets of calm and quiet could be found throughout the city in the form of parks and other natural areas, a legacy of Paris's emphasis on bringing the natural world into the urban landscape and of its recent efforts to combat climate change. ”how to be” both is a reflection on the interrelationship between these two very different sonic worlds living side by side and permeating one another. Throughout, it makes use of field recordings I've taken around Paris with a microphone this year, and reflects on how one can't cleanly separate the two types of sounds into distinct categories, urban and natural. I hope that this piece may contribute in a small way to the discussion of how we should approach our built environments as we look for solutions to climate change, and a demonstration of how to be both a modern city and a space for the living Earth. My thanks to my fellow artist-in-residence E i M O for her collaboration on the creation of this piece. Her in situ companion painting can be viewed around the concert hall and in the gallery above.",
    "scoreImageLoc": "photos/covers/ToBeBothArt.png",
    "soundCloudLink": "soundcloud%253Atracks%253A2193504727",
    "youtubeLink": "sVL1dyaDVu8"
},
{
    "id": 25,
    "type": "solo / duo",
    "instrumentation": "piano",
    "title": "Last Refuge",
    "year": "2025",
    "duration": "9'00",
    "premierDate": "27 June, 2025",
    "premierLocation": "Grand Salon, Fondation des États-Unis, Paris",
    "premierEnsemble": "Gabriel Newsham",
    "commission": true,
    "commissioner": "The Fulbright Program & the Fondation des États-Unis",
    "programNote": "As said by Samuel Johnson, ”Patriotism is the last refuge of a scoundrel.” Refugees have been on my mind a lot over the last several months. I've spent the past year living abroad, welcomed as a foreigner into someone else's country. I've been enriched by my experiences here, made lifelong friends, and deepened my understanding of the world. I'll forever be grateful for the immense opportunity I've been afforded in coming here. But my life never depended on it. I was never in any peril, never had to flee from some imminent danger. Moving abroad was a privilege, not a necessity, and my experience stands in stark contrast to the thousands of people forced to leave their homes and seek a new life abroad to escape war, famine, poverty or some other calamity. So when the new administration in Washington implemented its indefinite ban on refugees in the name of their ”America First” brand of patriotism, I felt revulsion. With the callous flick of a pen, thousands of desperate people seeking refuge were stranded beyond the safety of American shores. To me, this represents not only a betrayal of the refugees themselves but of the values that supposedly undergird our country, which for so many in history—my own ancestors likely included—served as the last, best refuge.Last Refuge is a meditation on these feelings. In it, I present two contrasting musical ideas: solid, stoic chords and a twinkling berceuse texture. Each starts the piece at one extreme of the piano's register. As the music progresses, the two ideas migrate toward the opposite end of the keyboard, crossing through one another and, by the end of the piece, finding refuge at last in a register far from their home.I think of Last Refuge as one half of a diptych. The other consists of my earlier piece Malicious Compliance, also a solo piano piece written in reaction to the actions of the new American administration.",
    "scoreImageLoc": "photos/covers/lastRefuge.png",
    "soundCloudLink": null,
    "youtubeLink": null
},
{
    "id": 24,
    "type": "solo / duo",
    "instrumentation": "piano",
    "title": "Îlot d'astres",
    "year": "2025",
    "duration": "12'00",
    "premierDate": "26 March, 2025",
    "premierLocation": "Salle Cortot, Paris",
    "premierEnsemble": "Daniel Strasberg",
    "commission": true,
    "commissioner": "Fondation Boucourechliev & l'École Normale de Musique de Paris",
    "programNote": "”Ilôt d'astres” is first and foremost a study in the style of the Bulgarian-French composer Andre Boucourechliev. Much of its source material, in fact, is taken from various of his works before being reconfigured, recomposed, transformed, transposed, inverted and otherwise made my own. On top of that, almost all of the techniques employed in the piece's construction, organization, and execution can be located somewhere in Boucourehliev's body of work. Nevertheless, I felt the strong urge to make the music reflect my musical personality in addition to that of Boucourechliev. One facet of my musical life is a loose adherence to a post-minimalist style, which explains why, when listening to Boucourechliev's music, I felt most drawn to those moments that were the simplest, pared down to the rudiments of the music. In my piece, I elongate moments such as those, lingering longer in the simplicity found within the complex relational web Boucourechliev's music inhabits. The vast majority of ”Ilôt d'astres” remains tranquil, quiet, and rhythmically loose, and I've come to think of the piece as a kind of nocturne. Like a great number of Boucourechliev's works, the score is an interconnected network of musical ideas linked together at certain points that confront the performer with interpretive choices regarding the organization of a performance. Any number of paths are available to the pianist, and consequently no two performances would be alike in structure. Therein lie a few of the prescient questions raised by Boucourechliev's music: How different can a work be from itself while remaining the same work? How much of the music must be fixed in place by the composer, as opposed to elected by a performer, in order for these two roles to remain distinct? And perhaps most importantly—for me at least—what is the relationship between composer and performer when it comes to the distribution of power, freedom, and control? Is that relationship bound to be autocratic , or is it possible to democratize it?.",
    "scoreImageLoc": "photos/covers/IlotDAstres.png",
    "soundCloudLink": null,
    "youtubeLink": null,
    "thumbnail": "photos/thumbnails/Ild.png"
},
    {
        "id": 23,
        "type": "large ensemble",
        "instrumentation": "orchestra",
        "title": "spiral-bound",
        "year": "2024",
        "duration": "10'",
        "premierDate": "9 March, 2025",
        "premierLocation": "Carnegie Hall, New York City NY",
        "premierEnsemble": "New York Youth Symphony",
        "commission": true,
        "commissioner": "New York Youth Symphony and Interlochen Center for the Arts",
        "programNote": "Over the last year or so I've been returning again and again to the idea of spirals as a structure, a form built out of continuous recursion in ever tightening circles. The natural world seems full of them. Whether it's spiral seashells, leaf structures, weather formations like hurricanes, or any number of other examples, everywhere I seemed to turn, there they were. Human psychology, too, seems to be imbued with them in the form of recurring, obsessive, thought patterns that are difficult to break free from. My spiral fixation is itself an example of this. So when I learned that this commissioned piece for the New York Youth Symphony was to be programmed alongside Brahms's final symphony, whose last movement is a magnificent passacaglia, it felt like the perfect opportunity to try it musically. A passacaglia, after all, is almost a kind of musical spiral, a repeating structure that governs the form and direction of the music. I set out to write my own, more-explicitly-spiral, less-explicitly-passacaglia passacaglia. The piece is broadly speaking built out of two contrasting types of material. The first, the 'spiral' theme, is a constantly transposing tone row that seems to circle back on itself, as if eating its own tail. Throughout the sections of the piece where it predominates, it undergoes a gradual process of intensification, starting extremely slow but getting faster and faster until, by the end, it has no choice but to disintegrate into chaos. The other type of material is a resistance to this process, a lyrical and reflective music that remains in a fixed harmonic place, contrasting with the spiral theme's harmonic itinerance. Over time, the spiral music infiltrates these calmer sections, wearing down their resistance, drawing them back into its orbit, until the piece, as it was ever bound to, has no choice but to spiral out of existence.",
        "scoreImageLoc": "photos/covers/spiralBound.png",
        "soundCloudLink": null,
        "thumbnail": "photos/thumbnails/spiral.png",
        "youtubeLink": null
    }, 
    {
        "id": 22,
        "type": "vocal",
        "instrumentation": "SATB choir",
        "title": "whereof one cannot speak",
        "year": "2024",
        "duration": "6'",
        "premierDate": "17 August, 2024",
        "premierLocation": "Norfolk Music Shed, Norfolk CT",
        "premierEnsemble": "Norfolk Festival Chamber Choir Chorus",
        "commission": true,
        "commissioner": "Norfolk Chamber Music Festival",
        "programNote": "When I was a kid I had an impossibly difficult time understanding lyrics in music. Whether it was the top 40 hits on the car radio or hymns in church, my brain always wanted to classify the voices I heard as just more instruments, timbres and nothing more. It took a deliberate effort on my part to be able to hear the voices as actually saying something, as meaning something, adding an additional layer of communication to the message of the music. 'whereof one cannot speak' in some ways tries to dramatize this experiential movement. It starts with the text — a little poem about language I cobbled together from fragments of Wittgenstein — broken into their smallest constituent phonemes, signifying nothing, functioning as sound alone. Over the course of the piece these sounds are pulled together into larger and larger chunks of the text, laboriously moved out of the realm of abstraction and, bit by bit, into recognizable language with meaning to convey. Only by the final sections of the piece can one actually hear what the words are trying to say.",
        "scoreImageLoc": "photos/covers/whereofOneCannotSpeak.jpg",
        "soundCloudLink": "1902301800",
        "youtubeLink": null
    }, 
    {
        "id": 21,
        "type": "large ensemble",
        "instrumentation": "orchestra",
        "title": "Estuary",
        "year": "2023",
        "duration": "9'",
        "premierDate": "7 December, 2023",
        "premierLocation": "Woolsey Hall, New Haven, CT",
        "premierEnsemble": "Yale School of Music Orchestra",
        "commission": false,
        "programNote": "The Colorado River is the lifeblood of the American Southwest. Starting from its source in the Rockies, throughout an otherwise arid region the river irrigates vast hectares of agricultural land and provides millions of people with drinking water. As one of those millions during my childhood, thoughts of where the water came from or where it went rarely crossed my mind. But today, as climate change places an ever greater strain on the river system, I often think about its imperiled future. A combination of drought, poor planning, and bad policy nearly emptied the river's reservoirs last year, but for decades before it had been drying up downstream, dammed and diverted for human consumption. At the Colorado's mouth, where in centuries past the river formed an estuary with the Gulf of California, the desert has overtaken the riverbed and water rarely reaches the ocean. Now, like so much of the natural world in the anthropocene, the estuary exists only in the traces left behind in the memory of the earth. My piece follows the river's course, from the stillness of snow-capped peaks to the stillness of the dry desert riverbed, in my own small contribution to this memory.",
        "scoreImageLoc": "photos/covers/Estuary.png",
        "soundCloudLink": "1697226831",
        "youtubeLink": "R_cI44pHR68?si=ztYKF56JvxEc8_l9"
    },
    {
        "id": 20,
        "type": "large ensemble",
        "instrumentation": "sinfonietta",
        "title": "Pressure System",
        "year": "2023",
        "duration": "11'",
        "premierDate": "30 June, 2023",
        "premierLocation": "The Clarice Smith Performing Arts Center, College Park, MD",
        "premierEnsemble": "National Orchestra Institute + Festival Orchestra",
        "commission": true,
        "commissioner": "National Orchestra Institute + Festival",
        "programNote": "Ever since I was a child I've been captivated by the beauty of changing weather and storm systems. I have memories from when I was growing up in Boulder, Colorado, of thunderstorms that felt at once terrifying and entrancing rolling down off the mountains, and my fascination with them was reinforced by elementary school field trips to NCAR — the meteorological and climate research facility nestled at the edge of the nearby the Rocky Mountains — where I learned the rudiments of how changes in atmospheric pressure result in the weather we experience.\n\nAs I wrote \"Pressure System,\" these memories resurfaced for me. While I don't think of this piece as programmatic, per se, in my mind it nevertheless follows a kind of linear progression that tracks the movement of a storm as it moves towards and then away from a vantage point from which you can watch the shifting clouds and changing colors from afar.",
        "scoreImageLoc": "photos/covers/PressureSystem.png",
        "soundCloudLink": "1689927204%3Fsecret_token%3Ds-CmceU4IfCTo",
        "youtubeLink": null
    }, 
    {
        "id": 19,
        "type": "large ensemble",
        "instrumentation": "orchestra",
        "title": "Vanishing Point",
        "year": "2020",
        "duration": "7'",
        "premierDate": " 19 February, 2020",
        "premierLocation": "Hill Auditorium, Ann Arbor, MI",
        "premierEnsemble": "University of Michigan, Symphony Orchestra",
        "commission": false,
        "programNote": "Things have a tendency to disappear into the haze of our memories. In the moment, an event or person can seem like the most important thing in the world, momentous and unparalleled, the locus of all our attention. But however large it may seem at the time, as months and years slip by the event dims, loses its particular luster, and joins with many others as an accumulating stream of experiences that go into making up a person. It becomes part of the landscape of our personality, blending together with other elements until we can no longer recognize its unique hue. If we pay attention, we might even notice this process as it happens, but we are powerless to stop it, and unsure if we would want to. The memory continues inexorably to dim, and like a watcher of the setting sun, we trace its path to the distant point where its light at last vanishes.",
        "scoreImageLoc": "photos/covers/VanishingPoint.png",
        "soundCloudLink": "807706414",
        "youtubeLink": "w3pqUOCkLVE"
    },
    {
        "id": 18,
        "type": "small ensemble",
        "instrumentation": "string quartet",
        "title": "butterfly effects",
        "year": "2023",
        "duration": "8'",
        "premierDate": "5 October, 2023",
        "premierLocation": "Sprague Recital Hall, New Haven, CT",
        "premierEnsemble": null,
        "commission": false,
        "programNote": "Like many people, I was saddened to learn of the death of the Finnish composer Kaija Saariaho this summer. Her passing prompted me to reflect on the impact her work has had on my own music, and in particular I thought about her touching and beautiful cello piece Sept Papillons, which has continued to move me on each new hearing since the day I first encountered it. The effects of that piece are evident, in one way or another, in much of my music, and so in remembrance of the composer who gave it life I decided to write butterfly effects, which is an amalgamation of quotes from Sept Papillons and newly composed material extrapolated from them. As a final tribute, I've also included a quotation from another of Saariaho's most beautiful works, Nuits, adieux, which was itself written as a memorial for her grandmother.",
        "scoreImageLoc": "photos/covers/butterflyEffects.png",
        "soundCloudLink": "1707535845",
        "youtubeLink": null
    },
    {
        "id": 17,
        "type": "small ensemble",
        "instrumentation": "violin, percussion quartet",
        "title": "Fits and Starts",
        "year": "2023",
        "duration": "7'",
        "premierDate": "9 February, 2023",
        "premierLocation": "Sprague Recital Hall, New Haven, CT",
        "premierEnsemble": "Yale Percussion Ensemble",
        "commission": false,
        "programNote": "The creative process is often a struggle for me. I'll sit on a piece idea for months—years, even—before finally deciding to commit it to paper. I wrestle with exactly how to get my point across, measuring the idea's unanticipated deficiencies and its surprising possibilities. When I write, I often turn a corner to find dead ends where I least expect them, and other times I round a bend to stumble across an oasis of untapped potential. It's a process of false starts and reconfigurations, but over time the work gradually emerges. Fits and Starts is in some ways a metaphor for that process, and in it I tried to take an idea and carry it as far as I felt it can bear before it emerges into a transformed landscape.",
        "scoreImageLoc": "photos/covers/FitsStarts.png",
        "soundCloudLink": "1503513664",
        "youtubeLink": null
    },
    {
        "id": 16,
        "type": "small ensemble",
        "instrumentation": "piano trio",
        "title": "An object of some concern",
        "year": "2021",
        "duration": "10'",
        "premierDate": "2 July, 2021",
        "premierLocation": "New Haven, CT (Virtual Event)",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "Most of my friends could tell you that I have a tendency towards understatement, especially when it comes to talking about my inner life. When I say, then, that something is 'an object of some concern,' you can be sure it's actually quite a large point of worry for me, the kind of anxiety-inducing thing I often become fixated on, turning around and around in my mind and worrying myself more all the while. This piece is about that experience of becoming stuck on a troubling feeling, in general, and about a specific worrisome fixation of mine in particular, the climate crisis. The piece opens with a violent plunge in the strings that mimics the feeling of suddenly awakening in the middle of the night, unable to breath. From there the trio propels itself forward with music that is unrelenting and obsessive, constantly straining higher and higher, threatening to snap, until finally it reaches its breaking point. This, of course, represents the experience of mounting anxiety, of becoming consumed by the feeling. But more than that, at the risk of being a bit too on the nose, I find that it also mimics the trajectory of global temperatures and the climate emergency.",
        "scoreImageLoc": "photos/covers/AnObject.png",
        "soundCloudLink": "1092901120",
        "youtubeLink": "Tq3k4x0mVmA"
    },
    {
        "id": 15,
        "type": "small ensemble",
        "instrumentation": "percussion quartet",
        "title": "The Nature of Entropy",
        "year": "2019",
        "duration": "45'",
        "premierDate": "13 April, 2019",
        "premierLocation": "Hankinson Recital Hall, Ann Arbor, MI",
        "premierEnsemble": "",
        "commission": true,
        "commissioner": "Conner Darling",
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "807246796",
        "youtubeLink": "50MT7OYIBT8"
    },
    {
        "id": 14,
        "type": "small ensemble",
        "instrumentation": "scordatura string quartet",
        "title": "Isolation of sky at evening",
        "year": "2018",
        "duration": "9'",
        "premierDate": "28 April, 2019",
        "premierLocation": "Kevreson Recital Hall, Ann Arbor, MI",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": null,
        "youtubeLink": null,
        "thumbnail": "photos/thumbnails/isolationSky.jpg"
    },
    {
        "id": 13,
        "type": "small ensemble",
        "instrumentation": "violin, bassoon, percussion, piano",
        "title": "Architecture of Silence",
        "year": "2017",
        "duration": "10'",
        "premierDate": "4 March, 2018",
        "premierLocation": "Hankinson Recital Hall, Ann Arbor, MI",
        "premierEnsemble": "Front Porch",
        "commission": true,
        "commissioner": "Front Porch",
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "807223801",
        "youtubeLink": "-Ul0YIaOK74"
    },
    {
        "id": 12,
        "type": "small ensemble",
        "instrumentation": "string quartet",
        "title": "still life: desert rain",
        "year": "2016",
        "duration": "5'",
        "premierDate": "25 March, 2027",
        "premierLocation": "Kevreson Recital Hall, Ann Arbor, MI",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "807691555",
        "youtubeLink": "dOinQofrISQ"
    },
    {
        "id": 11,
        "type": "small ensemble",
        "instrumentation": "flute, two violins, viola, cello",
        "title": "Seven Vignettes",
        "year": "2015",
        "duration": "9'30",
        "premierDate": "9 August, 2015",
        "premierLocation": "Boston University Tanglewood Institute, Lenox, MA",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "807222862",
        "youtubeLink": null
    },
    {
        "id": 10,
        "type": "small ensemble",
        "instrumentation": "saxophone ensemble",
        "title": "Monadnock",
        "year": "2015",
        "duration": "4'",
        "premierDate": "24 April, 2015",
        "premierLocation": "New Winston Museum, Winston-Salem, NC",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "807221875",
        "youtubeLink": null
    },
    {
        "id": 9,
        "type": "solo / duo",
        "instrumentation": "violin duet",
        "title": "kaleidoscopic harmonic",
        "year": "2024",
        "duration": "8'",
        "premierDate": "18 April, 2024",
        "premierLocation": "Sprague Hall, New Haven, CT",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "kaleidoscopic harmonic is a short violin duo written for two friends. The metaphor that harmony is to sound what color is to sight is well-worn, but in approaching this piece I embraced it. I tried to imagine sonic transformations as if they were shifting shades and shapes in a rotating kaleidoscope, as a kind of collage. Initially, the violins behave as if one instrument, but gradually they pull apart from one another as aspects of the collage become superimposed and the kaleidoscope disintegrates. The title, which I shamelessly lifted from a friend's turn of phrase, helped crystallize my thinking.",
        "scoreImageLoc": null,
        "soundCloudLink": "1811453316",
        "youtubeLink": null
    },
    {
        "id": 8,
        "type": "solo / duo",
        "instrumentation": "cello, piano",
        "title": "A blue heron alights on the riverbank near dawn",
        "year": "2023",
        "duration": "10'",
        "premierDate": "9 March, 2023",
        "premierLocation": "Sprague Hall, New Haven, CT",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "Perhaps I'm a bit late in writing a piece about an early pandemic experience, but in the time since 2020 I've returned to the same memory often enough that I felt compelled to do something with it.\n\nIn the first months of the lockdown following Covid-19's emergence, I (like a lot of people) got into the habit of taking long walks to stave off cabin fever and anxiety. Most often, I would circle down the sloping route to the river and follow the water's winding way. As the weeks wore on and the riverside paths grew more populous with stir-crazy quarantiners, I began to take these strolls in the moments just after dawn, when I could be alone with nature.\n\nOne mist-shrouded morning, out of the corner of my eye I glimpsed a blue heron balancing on one leg in shallow water, unperturbed by my presence. We watched one another silently for a few minutes, before the bird, with a nonchalant gesture, spread its wings and flew off down the river. It was a comfort, in that uncertain and chaotic time, to see a fellow creature so unbothered by its surroundings, seemingly at peace with the world. I carried that image with me, as a symbol, for months to come.",
        "scoreImageLoc": "photos/covers/blueHeron.png",
        "soundCloudLink": "1641534129",
        "youtubeLink": null
    },
    {
        "id": 7,
        "type": "solo / duo",
        "instrumentation": "marimba, vibraphone, fixed media",
        "title": "A light dusting of snow",
        "year": "2023",
        "duration": "10'",
        "premierDate": "29 March, 2023",
        "premierLocation": "Illinois State University, Normal, IL",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "I loved snow as a child. I loved the way it would blanket the landscape, masking shape and color beneath a white sheet of powder. I loved its sound, its crunch under my shoes, and I loved how it could mute the world and swallow ambient noise, could invite me to pay attention to the quietest of sounds, to listen to things verging on the inaudible.\n\nThis winter is the first in my adult life to have come and gone without any real snow to speak of. In the city where I live, we had merely a light, ephemeral dusting that melted away within a day. This atypical weather inspired me to reflect on the things I loved and missed about snow, and on the precious, private experiences we are collectively losing in our warming world. And so I've written a piece that attempts to capture the sonic elements of snow that fascinate me, a piece that invites you to listen closely and appreciate the weight of silences. Hopefully it might inspire you, in turn, to listen with new ears to the world of winter.",
        "scoreImageLoc": "photos/covers/lightSnow.png",
        "soundCloudLink": null,
        "youtubeLink": null,
        "thumbnail": "photos/thumbnails/snow.jpg"
    },
    {
        "id": 6,
        "type": "solo / duo",
        "instrumentation": "viola",
        "title": "First light, a bird is singing ",
        "year": "2019",
        "duration": "5'",
        "premierDate": "14 August, 2019",
        "premierLocation": "Chiesa di Santa Maria di Canepanova, Pavia, Italy",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "807221725",
        "youtubeLink": "LRF9znUdDc0"
    },
    {
        "id": 5,
        "type": "solo / duo",
        "instrumentation": "violin, piano",
        "title": "Sometimes, the rain",
        "year": "2018",
        "duration": "5'30\"",
        "premierDate": "17 June, 2018",
        "premierLocation": "Salisbury Congregational Church, Salisbury, VT",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": null,
        "youtubeLink": null
    },
    {
        "id": 4,
        "type": "solo / duo",
        "instrumentation": "cello",
        "title": "Prelude, Fugue, and Lamento",
        "year": "2015",
        "duration": "9'",
        "premierDate": "2 April, 2016",
        "premierLocation": "Britton Recital Hall, Ann Arbor, MI",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "807222307",
        "youtubeLink": null
    },
    {
        "id": 3,
        "type": "vocal",
        "instrumentation": "tenor voice",
        "title": "Na Fataí Bána",
        "year": "2020",
        "duration": "4'",
        "premierDate": "14 July, 2021",
        "premierLocation": "Château de Fontainebleau, Île-de-France",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "1707544998%3Fsecret_token%3Ds-z4rimeDsvDT",
        "youtubeLink": null
    },
    {
        "id": 2,
        "type": "vocal",
        "instrumentation": "baritone voice, violin, cello, oboe",
        "title": "how the sky looked",
        "year": "2017",
        "duration": "5'",
        "premierDate": "15 March, 2017",
        "premierLocation": "Stamps Auditorium, Ann Arbor, MI",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": "807221509",
        "youtubeLink": null
    },
    {
        "id": 1,
        "type": "vocal",
        "instrumentation": "mezzo-soprano, tenor, piano",
        "title": "Upon All",
        "year": "2014",
        "duration": "20'",
        "premierDate": "24 January, 2015",
        "premierLocation": "Watson Recital Hall, Winston-Salem, NC",
        "premierEnsemble": "",
        "commission": false,
        "programNote": "",
        "scoreImageLoc": null,
        "soundCloudLink": null,
        "youtubeLink": null
    }
]
  
